       identification division.
       program-id. programIDName.
       
       environment division.
       configuration section.
       
       data division.
       working-storage section.
       
       procedure division.
         DISPLAY "hello word".
       STOP RUN.
       goback.
        goback.
       
       end program programIDName.